avrdudes/avr-libc/include/avr/ioavr128db28.h
/* Analog Comparator 2 Output select bit group values */
typedef enum PORTMUX_AC2_VALUES_enum
{
    PORTMUX_AC2_DEFAULT_gv         = 0x00   /* OUT: PA7 */
} PORTMUX_AC2_values_t;

/* Analog Comparator 2 Output select bit group configurations*/
typedef enum PORTMUX_AC2_enum
{
    PORTMUX_AC2_DEFAULT_gc         = (PORTMUX_AC2_DEFAULT_gv << PORTMUX_AC2_bp)   /* OUT: PA7 */
} PORTMUX_AC2_t;

/* Event Output A select bit group values */
typedef enum PORTMUX_EVOUTA_VALUES_enum
{
    PORTMUX_EVOUTA_DEFAULT_gv      = 0x00,  /* EVOUTA: PA2 */
    PORTMUX_EVOUTA_ALT1_gv         = 0x01   /* EVOUTA: PA7 */
} PORTMUX_EVOUTA_values_t;

/* Event Output A select bit group configurations*/
typedef enum PORTMUX_EVOUTA_enum
{
    PORTMUX_EVOUTA_DEFAULT_gc      = (PORTMUX_EVOUTA_DEFAULT_gv << PORTMUX_EVOUTA_bp),  /* EVOUTA: PA2 */
    PORTMUX_EVOUTA_ALT1_gc         = (PORTMUX_EVOUTA_ALT1_gv << PORTMUX_EVOUTA_bp)   /* EVOUTA: PA7 */
} PORTMUX_EVOUTA_t;

/* Event Output C select bit group values */
typedef enum PORTMUX_EVOUTC_VALUES_enum
{
    PORTMUX_EVOUTC_DEFAULT_gv      = 0x00   /* EVOUTC: PC2 */
} PORTMUX_EVOUTC_values_t;

/* Event Output C select bit group configurations*/
typedef enum PORTMUX_EVOUTC_enum
{
    PORTMUX_EVOUTC_DEFAULT_gc      = (PORTMUX_EVOUTC_DEFAULT_gv << PORTMUX_EVOUTC_bp)   /* EVOUTC: PC2 */
} PORTMUX_EVOUTC_t;

/* Event Output D select bit group values */
typedef enum PORTMUX_EVOUTD_VALUES_enum
{
    PORTMUX_EVOUTD_DEFAULT_gv      = 0x00,  /* EVOUTD: PD2 */
    PORTMUX_EVOUTD_ALT1_gv         = 0x01   /* EVOUTD: PD7 */
} PORTMUX_EVOUTD_values_t;

/* Event Output D select bit group configurations*/
typedef enum PORTMUX_EVOUTD_enum
{
    PORTMUX_EVOUTD_DEFAULT_gc      = (PORTMUX_EVOUTD_DEFAULT_gv << PORTMUX_EVOUTD_bp),  /* EVOUTD: PD2 */
    PORTMUX_EVOUTD_ALT1_gc         = (PORTMUX_EVOUTD_ALT1_gv << PORTMUX_EVOUTD_bp)   /* EVOUTD: PD7 */
} PORTMUX_EVOUTD_t;

/* CCL Look-Up Table 0 Signals select bit group values */
typedef enum PORTMUX_LUT0_VALUES_enum
{
    PORTMUX_LUT0_DEFAULT_gv        = 0x00,  /* In: PA0, PA1, PA2 Out: PA3 */
    PORTMUX_LUT0_ALT1_gv           = 0x01   /* In: PA0, PA1, PA2 Out: PA6 */
} PORTMUX_LUT0_values_t;

/* CCL Look-Up Table 0 Signals select bit group configurations*/
typedef enum PORTMUX_LUT0_enum
{
    PORTMUX_LUT0_DEFAULT_gc        = (PORTMUX_LUT0_DEFAULT_gv << PORTMUX_LUT0_bp),  /* In: PA0, PA1, PA2 Out: PA3 */
    PORTMUX_LUT0_ALT1_gc           = (PORTMUX_LUT0_ALT1_gv << PORTMUX_LUT0_bp)   /* In: PA0, PA1, PA2 Out: PA6 */
} PORTMUX_LUT0_t;

/* CCL Look-Up Table 1 Signals select bit group values */
typedef enum PORTMUX_LUT1_VALUES_enum
{
    PORTMUX_LUT1_DEFAULT_gv        = 0x00,  /* In: PC0, PC1, PC2 Out: PC3 */
    PORTMUX_LUT1_ALT1_gv           = 0x01   /* In: PC0, PC1, PC2 Out: - */
} PORTMUX_LUT1_values_t;

/* CCL Look-Up Table 1 Signals select bit group configurations*/
typedef enum PORTMUX_LUT1_enum
{
    PORTMUX_LUT1_DEFAULT_gc        = (PORTMUX_LUT1_DEFAULT_gv << PORTMUX_LUT1_bp),  /* In: PC0, PC1, PC2 Out: PC3 */
    PORTMUX_LUT1_ALT1_gc           = (PORTMUX_LUT1_ALT1_gv << PORTMUX_LUT1_bp)   /* In: PC0, PC1, PC2 Out: - */
} PORTMUX_LUT1_t;

/* CCL Look-Up Table 2 Signals select bit group values */
typedef enum PORTMUX_LUT2_VALUES_enum
{
    PORTMUX_LUT2_DEFAULT_gv        = 0x00,  /* In: -, PD1, PD2 Out: PD3 */
    PORTMUX_LUT2_ALT1_gv           = 0x01   /* In: -, PD1, PD2 Out: PD6 */
} PORTMUX_LUT2_values_t;

/* CCL Look-Up Table 2 Signals select bit group configurations*/
typedef enum PORTMUX_LUT2_enum
{
    PORTMUX_LUT2_DEFAULT_gc        = (PORTMUX_LUT2_DEFAULT_gv << PORTMUX_LUT2_bp),  /* In: -, PD1, PD2 Out: PD3 */
    PORTMUX_LUT2_ALT1_gc           = (PORTMUX_LUT2_ALT1_gv << PORTMUX_LUT2_bp)   /* In: -, PD1, PD2 Out: PD6 */
} PORTMUX_LUT2_t;

/* CCL Look-Up Table 3 Signals select bit group values */
typedef enum PORTMUX_LUT3_VALUES_enum
{
    PORTMUX_LUT3_DEFAULT_gv        = 0x00   /* In: PF0, PF1, - Out: - */
} PORTMUX_LUT3_values_t;

/* CCL Look-Up Table 3 Signals select bit group configurations*/
typedef enum PORTMUX_LUT3_enum
{
    PORTMUX_LUT3_DEFAULT_gc        = (PORTMUX_LUT3_DEFAULT_gv << PORTMUX_LUT3_bp)   /* In: PF0, PF1, - Out: - */
} PORTMUX_LUT3_t;

/* SPI0 Signals select bit group values */
typedef enum PORTMUX_SPI0_VALUES_enum
{
    PORTMUX_SPI0_DEFAULT_gv        = 0x00,  /* MOSI: PA4, MISO: PA5, SCK: PA6, SS: PA7 */
    PORTMUX_SPI0_NONE_gv           = 0x03   /* Not connected to any pins */
} PORTMUX_SPI0_values_t;

/* SPI0 Signals select bit group configurations*/
typedef enum PORTMUX_SPI0_enum
{
    PORTMUX_SPI0_DEFAULT_gc        = (PORTMUX_SPI0_DEFAULT_gv << PORTMUX_SPI0_gp),  /* MOSI: PA4, MISO: PA5, SCK: PA6, SS: PA7 */
    PORTMUX_SPI0_NONE_gc           = (PORTMUX_SPI0_NONE_gv << PORTMUX_SPI0_gp)   /* Not connected to any pins */
} PORTMUX_SPI0_t;

/* SPI1 Signals select bit group values */
typedef enum PORTMUX_SPI1_VALUES_enum
{
    PORTMUX_SPI1_DEFAULT_gv        = 0x00,  /* MOSI: PC0, MISO: PC1, SCK: PC2, SS: PC3 */
    PORTMUX_SPI1_NONE_gv           = 0x03   /* Not connected to any pins */
} PORTMUX_SPI1_values_t;

/* SPI1 Signals select bit group configurations*/
typedef enum PORTMUX_SPI1_enum
{
    PORTMUX_SPI1_DEFAULT_gc        = (PORTMUX_SPI1_DEFAULT_gv << PORTMUX_SPI1_gp),  /* MOSI: PC0, MISO: PC1, SCK: PC2, SS: PC3 */
    PORTMUX_SPI1_NONE_gc           = (PORTMUX_SPI1_NONE_gv << PORTMUX_SPI1_gp)   /* Not connected to any pins */
} PORTMUX_SPI1_t;

/* TCA0 Signals select bit group values */
typedef enum PORTMUX_TCA0_VALUES_enum
{
    PORTMUX_TCA0_PORTA_gv          = 0x00,  /* WOn: PA0, PA1, PA2, PA3, PA4, PA5 */
    PORTMUX_TCA0_PORTC_gv          = 0x02,  /* WOn: PC0, PC1, PC2, PC3, -, - */
    PORTMUX_TCA0_PORTD_gv          = 0x03,  /* WOn: -, PD1, PD2, PD3, PD4, PD5 */
    PORTMUX_TCA0_PORTF_gv          = 0x05   /* WOn: PF0, PF1, -, -, -, - */
} PORTMUX_TCA0_values_t;

/* TCA0 Signals select bit group configurations*/
typedef enum PORTMUX_TCA0_enum
{
    PORTMUX_TCA0_PORTA_gc          = (PORTMUX_TCA0_PORTA_gv << PORTMUX_TCA0_gp),  /* WOn: PA0, PA1, PA2, PA3, PA4, PA5 */
    PORTMUX_TCA0_PORTC_gc          = (PORTMUX_TCA0_PORTC_gv << PORTMUX_TCA0_gp),  /* WOn: PC0, PC1, PC2, PC3, -, - */
    PORTMUX_TCA0_PORTD_gc          = (PORTMUX_TCA0_PORTD_gv << PORTMUX_TCA0_gp),  /* WOn: -, PD1, PD2, PD3, PD4, PD5 */
    PORTMUX_TCA0_PORTF_gc          = (PORTMUX_TCA0_PORTF_gv << PORTMUX_TCA0_gp)   /* WOn: PF0, PF1, -, -, -, - */
} PORTMUX_TCA0_t;

/* TCB0 Output select bit group values */
typedef enum PORTMUX_TCB0_VALUES_enum
{
    PORTMUX_TCB0_DEFAULT_gv        = 0x00   /* WO: PA2 */
} PORTMUX_TCB0_values_t;

/* TCB0 Output select bit group configurations*/
typedef enum PORTMUX_TCB0_enum
{
    PORTMUX_TCB0_DEFAULT_gc        = (PORTMUX_TCB0_DEFAULT_gv << PORTMUX_TCB0_bp)   /* WO: PA2 */
} PORTMUX_TCB0_t;

/* TCB1 Output select bit group values */
typedef enum PORTMUX_TCB1_VALUES_enum
{
    PORTMUX_TCB1_DEFAULT_gv        = 0x00   /* WO: PA3 */
} PORTMUX_TCB1_values_t;

/* TCB1 Output select bit group configurations*/
typedef enum PORTMUX_TCB1_enum
{
    PORTMUX_TCB1_DEFAULT_gc        = (PORTMUX_TCB1_DEFAULT_gv << PORTMUX_TCB1_bp)   /* WO: PA3 */
} PORTMUX_TCB1_t;

/* TCB2 Output select bit group values */
typedef enum PORTMUX_TCB2_VALUES_enum
{
    PORTMUX_TCB2_DEFAULT_gv        = 0x00   /* WO: PC0 */
} PORTMUX_TCB2_values_t;

/* TCB2 Output select bit group configurations*/
typedef enum PORTMUX_TCB2_enum
{
    PORTMUX_TCB2_DEFAULT_gc        = (PORTMUX_TCB2_DEFAULT_gv << PORTMUX_TCB2_bp)   /* WO: PC0 */
} PORTMUX_TCB2_t;

